---
kind: property
id: P:Autodesk.Revit.DB.Structure.BendingDetailCustomFieldProperties.BendDiameterDimensionsForHooksEnabled
source: html/6eb8246b-1b2d-5344-babd-4b0eea2c0990.htm
---
# Autodesk.Revit.DB.Structure.BendingDetailCustomFieldProperties.BendDiameterDimensionsForHooksEnabled Property

Identifies if radial or diameter dimensions will be shown for hook fillets
 This property has a meaning only if BendDiameterDimensionsEnabled is set to true.

## Syntax (C#)
```csharp
public bool BendDiameterDimensionsForHooksEnabled { get; set; }
```